# 문자열 포맷

# print("a"+ "b") 
# print("a","b")


# 방법1 : %사용
print("나는 20살입니다.")
print("나는 %d살입니다." %20)
# d는 정수를 의미함.

print("나는 %s을 좋아해요." %"파이썬")
# s는 문자열을 의미함.
print("나는 %s살입니다." %20)

print("Apple은 %c로 시작해요." %'A')
# c는 하나의 문자만 가능.

# 문자열 포맷 두 개 %( , )
print("나는 %s색과 %s색을 좋아해요." %('노랑','보라'))


#---------------------------------------------------------------------------------------------
print()
#---------------------------------------------------------------------------------------------


# 방법2 : {} 사용
print("나는 {}살입니다.".format(20))
print("나는 {}색과 {}색을 좋아해요.".format("파란", "분홍"))
print("나는 {0}색과 {1}색을 좋아해요.".format("파란", "분홍"))
print("나는 {1}색과 {0}색을 좋아해요.".format("파란", "분홍"))


#---------------------------------------------------------------------------------------------
print()
#---------------------------------------------------------------------------------------------


# 방법3 : {}와 변수 사용
print("나는 {age}살이고, {color}색을 좋아해요.".format(age = 20, color = "분홍"))
print("나는 {age}살이고, {color}색을 좋아해요.".format(color = "분홍", age = 20))


#---------------------------------------------------------------------------------------------
print()
#---------------------------------------------------------------------------------------------


# 방법4(python v.3.6이상) : {}와 변수 사용(2)
age = 20
color = "보라"
print(f"나는 {age}살이고, {color}색을 좋아해요.")