# R studio 개요 -------------------------------------------
# 왼쪽 상단 화면 : 스크립트
# 코딩, 분석할 내용을 작성
# R 프로그램 명령문을 입력하는 창

# 왼쪽 하단 화면 : 콘솔창
# 명령문 실행의 결과 내용 확인

# 우측 상단 화면 : 워크 스페이스
# 작업한 내용의 기록
# 분석자가 생성한 변수와 데이터 작업 내용을 확인 

# 우측 하단 화면 : 시각화 및 도움말 제공, 폴더 지정 등


# 환경설정 ------------------------------------------------
# 상단메뉴 Tools > Global Options > Appearance : 폰트, 테마, 색 변경
# 상단메뉴 Tools > Global Options > code > saving : 인코딩 설정 변경


# R 프로그래밍의 장점 -------------------------------------
# 데이터만 있다면 무엇이든지 R로 분석 가능하다
# 지도, 트리구조, 시계열, 인터넷 문자 분석 등 다양한 빅데이터 분석